Ran Plan for dir: `infrastructure` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_eks_cluster.my_cluster will be created
+ resource "aws_eks_cluster" "my_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "EKS-cluster-for-atlantis"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Name" = "hm-terraform-eks"
        }
      + version               = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.nodes will be created
+ resource "aws_eks_node_group" "nodes" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + cluster_name    = "EKS-cluster-for-atlantis"
      + disk_size       = (known after apply)
      + id              = (known after apply)
      + instance_types  = (known after apply)
      + node_group_name = "nodes"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = (known after apply)
      + tags            = {
          + "Name" = "hm-terraform-eks"
        }
      + version         = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }
    }

  # aws_iam_role.cluster will be created
+ resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-eks-cluster"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_kubectl_admin_role will be created
+ resource "aws_iam_role" "eks_kubectl_admin_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::870160856428:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-admin"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_kubectl_read_only_role will be created
+ resource "aws_iam_role" "eks_kubectl_read_only_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::870160856428:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-read-only"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.worker-node will be created
+ resource "aws_iam_role" "worker-node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-eks-node"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster-AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "terraform-eks-cluster"
    }

  # aws_iam_role_policy_attachment.cluster-AmazonEKSServicePolicy will be created
+ resource "aws_iam_role_policy_attachment" "cluster-AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "terraform-eks-cluster"
    }

  # aws_iam_role_policy_attachment.worker-node-AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "worker-node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "terraform-eks-node"
    }

  # aws_iam_role_policy_attachment.worker-node-AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "worker-node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "terraform-eks-node"
    }

  # aws_iam_role_policy_attachment.worker-node-AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "worker-node-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "terraform-eks-node"
    }

  # aws_internet_gateway.eks_gateway will be created
+ resource "aws_internet_gateway" "eks_gateway" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "hm-terraform-eks"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.eks_rt will be created
+ resource "aws_route_table" "eks_rt" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "hm-terraform-eks"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.eks_rta[0] will be created
+ resource "aws_route_table_association" "eks_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.eks_rta[1] will be created
+ resource "aws_route_table_association" "eks_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.cluster will be created
+ resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Cluster communication with worker nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "terraform-eks-cluster"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "hm-terraform-eks"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.cluster-ingress-workstation-https will be created
+ resource "aws_security_group_rule" "cluster-ingress-workstation-https" {
      + cidr_blocks              = [
          + "63.32.98.233/32",
        ]
      + description              = "Allow workstation to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_subnet.eks_subnet[0] will be created
+ resource "aws_subnet" "eks_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                           = "hm-terraform-eks"
          + "kubernetes.io/cluster/EKS-cluster-for-atlantis" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.eks_subnet[1] will be created
+ resource "aws_subnet" "eks_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                           = "hm-terraform-eks"
          + "kubernetes.io/cluster/EKS-cluster-for-atlantis" = "shared"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.eks_vpc will be created
+ resource "aws_vpc" "eks_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"                                           = "hm-terraform-eks"
          + "kubernetes.io/cluster/EKS-cluster-for-atlantis" = "shared"
        }
    }

  # kubernetes_cluster_role.eks_admin_role will be created
+ resource "kubernetes_cluster_role" "eks_admin_role" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-admin"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "*",
            ]
        }
    }

  # kubernetes_cluster_role.eks_read_only_role will be created
+ resource "kubernetes_cluster_role" "eks_read_only_role" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-read-only"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "describe",
              + "watch",
            ]
        }
    }

  # kubernetes_cluster_role_binding.eks_admin_role_binding will be created
+ resource "kubernetes_cluster_role_binding" "eks_admin_role_binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-admin-role-binding"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "eks-admin"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "eks-admin"
          + namespace = "default"
        }
    }

  # kubernetes_cluster_role_binding.eks_read_only_role_binding will be created
+ resource "kubernetes_cluster_role_binding" "eks_read_only_role_binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "eks-read-only-role-binding"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "eks-read-only"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "eks-read-only"
          + namespace = "default"
        }
    }

  # kubernetes_config_map.aws_auth_configmap will be created
+ resource "kubernetes_config_map" "aws_auth_configmap" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # null_resource.demo will be created
+ resource "null_resource" "demo" {
      + id = (known after apply)
    }

  # null_resource.update-kubeconfig will be created
+ resource "null_resource" "update-kubeconfig" {
      + id = (known after apply)
    }

  # null_resource.wait-until-ready will be created
+ resource "null_resource" "wait-until-ready" {
      + id = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure`
* :put_litter_in_its_place: To **delete** this plan click [here](http://chart-example.local/lock?id=KipsasJaujoj%252Fatlantis-on-eks%252Finfrastructure%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
